Revit 2026 API

# BuildingPadCreate Method

---
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static BuildingPad Create(
	Document document,
	ElementId buildingPadTypeId,
	ElementId levelId,
	IList<CurveLoop> curveLoops
)
```
```vb
Public Shared Function Create (
	document As Document,
	buildingPadTypeId As ElementId,
	levelId As ElementId,
	curveLoops As IList(Of CurveLoop)
) As BuildingPad
```
```cpp
public:
static BuildingPad^ Create(
	Document^ document,
	ElementId^ buildingPadTypeId,
	ElementId^ levelId,
	IList<CurveLoop^>^ curveLoops
)
```
```fsharp
static member Create :
        document : Document *
        buildingPadTypeId : ElementId *
        levelId : ElementId *
        curveLoops : IList<CurveLoop> -> BuildingPad
```

#### Parameters

document Document

buildingPadTypeId ElementId

levelId ElementId

curveLoops IListCurveLoop

#### Return Value

BuildingPad

#### Reference

BuildingPad Class

Autodesk.Revit.DB.Architecture Namespace